src/Catalogs/ПартииТМЦВЭксплуатации/ПартииТМЦВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПартииТМЦВЭксплуатации</name>
  <attributes>
    <name>КатегорияЭксплуатации</name>
    <type>
      <types>CatalogRef.КатегорииЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ВводОстатков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияНаработки</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиБУ</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиНУ</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПартия</name>
    <type>
      <types>CatalogRef.ПартииТМЦВЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия258</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнвентарныйНомер</name>
    <type>
      <types>DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПартииТМЦВЭксплуатации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	Если Объект.СрокЭксплуатации <> 0 Тогда
		
		СрокЭксплуатацииСтрокой = СтрШаблон(
					НСтр("ru = 'с %1 по %2 (%3 мес)';
						|en = 'from %1 to %2 (%3 months)'"),
					Формат(Объект.ДатаНачалаЭксплуатации, НСтр("ru = 'ДФ=''ММММ гггг ""г""''';
																|en = 'DF=''MMMM yyyy'''")),
					Формат(Объект.ДатаЗавершенияЭксплуатации, НСтр("ru = 'ДФ=''ММММ гггг ""г""''';
																	|en = 'DF=''MMMM yyyy'''")),
					Строка(Объект.СрокЭксплуатации));
					
	Иначе
		
		СрокЭксплуатацииСтрокой = СтрШаблон(
					НСтр("ru = 'с %1';
						|en = 'from %1'"),
					Формат(Объект.ДатаНачалаЭксплуатации, НСтр("ru = 'ДФ=''ММММ гггг ""г""''';
																|en = 'DF=''MMMM yyyy'''")));
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
